sdaiCreateNestedAggrByItrADB(Sdai_ItrId*,Sdai_ADBId*)
\details
Creates an aggregate instance replacing the current member of the
aggregate instance referenced by the specified iterator
\param current [in]  iterator referencing the current member of the aggregate.
\param selaggrInstance [in] ADB specifying the type of aggregate to create.
\returns Returns identifier of the newly created aggregate instance.